diagrams: move plantuml to mermaid (end)
